Revit 2026 API

# ZoneSpaces Property

---

Get the Spaces of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpaceSet Spaces { get; }
```
```vb
Public ReadOnly Property Spaces As SpaceSet
	Get
```
```cpp
public:
property SpaceSet^ Spaces {
	SpaceSet^ get ();
}
```
```fsharp
member Spaces : SpaceSet with get
```

#### Property Value

SpaceSet

This property is used to get the Spaces of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace